collected-data/gfs-4-rep-results/experiements-1-3/no-failure/run-1/fio-gfs-test-low-seq-write-tnf.txt
Started: 04-04-2022--17-40-17

low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=6617: Mon Apr  4 17:40:54 2022
  write: IOPS=21, BW=2769KiB/s (2836kB/s)(89.1MiB/32958msec); 0 zone resets
    slat (nsec): min=31848, max=60273, avg=39785.52, stdev=2998.13
    clat (usec): min=45832, max=50077, avg=46172.06, stdev=200.31
     lat (usec): min=45873, max=50118, avg=46213.66, stdev=200.40
    clat percentiles (usec):
     |  1.00th=[45876],  5.00th=[45876], 10.00th=[45876], 20.00th=[45876],
     | 30.00th=[45876], 40.00th=[45876], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[46400], 99.50th=[46400], 99.90th=[50070], 99.95th=[50070],
     | 99.99th=[50070]
   bw (  KiB/s): min= 2560, max= 2821, per=100.00%, avg=2769.12, stdev=99.89, samples=65
   iops        : min=   20, max=   22, avg=21.63, stdev= 0.78, samples=65
  lat (msec)   : 50=99.86%, 100=0.14%
  cpu          : usr=0.04%, sys=0.05%, ctx=1428, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2769KiB/s (2836kB/s), 2769KiB/s-2769KiB/s (2836kB/s-2836kB/s), io=89.1MiB (93.5MB), run=32958-32958msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=7200: Mon Apr  4 17:42:32 2022
  write: IOPS=21, BW=2765KiB/s (2831kB/s)(89.1MiB/33011msec); 0 zone resets
    slat (nsec): min=33454, max=75639, avg=39577.88, stdev=3446.31
    clat (usec): min=45856, max=65520, avg=46247.05, stdev=872.29
     lat (usec): min=45895, max=65559, avg=46288.48, stdev=872.10
    clat percentiles (usec):
     |  1.00th=[45876],  5.00th=[45876], 10.00th=[45876], 20.00th=[45876],
     | 30.00th=[45876], 40.00th=[46400], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[47973], 99.50th=[50070], 99.90th=[65274], 99.95th=[65274],
     | 99.99th=[65274]
   bw (  KiB/s): min= 2560, max= 2821, per=99.90%, avg=2762.08, stdev=105.29, samples=66
   iops        : min=   20, max=   22, avg=21.58, stdev= 0.82, samples=66
  lat (msec)   : 50=99.44%, 100=0.56%
  cpu          : usr=0.05%, sys=0.04%, ctx=1427, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2765KiB/s (2831kB/s), 2765KiB/s-2765KiB/s (2831kB/s-2831kB/s), io=89.1MiB (93.5MB), run=33011-33011msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=7790: Mon Apr  4 17:44:09 2022
  write: IOPS=21, BW=2767KiB/s (2834kB/s)(89.1MiB/32979msec); 0 zone resets
    slat (nsec): min=31708, max=57828, avg=39236.91, stdev=3127.20
    clat (usec): min=45824, max=55023, avg=46202.46, stdev=356.81
     lat (usec): min=45866, max=55066, avg=46243.51, stdev=356.95
    clat percentiles (usec):
     |  1.00th=[45876],  5.00th=[45876], 10.00th=[45876], 20.00th=[45876],
     | 30.00th=[45876], 40.00th=[46400], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[46400], 99.50th=[46400], 99.90th=[54789], 99.95th=[54789],
     | 99.99th=[54789]
   bw (  KiB/s): min= 2560, max= 2821, per=99.92%, avg=2765.18, stdev=103.01, samples=65
   iops        : min=   20, max=   22, avg=21.60, stdev= 0.81, samples=65
  lat (msec)   : 50=99.86%, 100=0.14%
  cpu          : usr=0.03%, sys=0.06%, ctx=1429, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2767KiB/s (2834kB/s), 2767KiB/s-2767KiB/s (2834kB/s-2834kB/s), io=89.1MiB (93.5MB), run=32979-32979msec